#+STARTUP: folded indent inlineimages latexpreview

* 1. Introduction to Research

#+begin_src python :session
2 + 2
#+end_src

#+RESULTS:
: 4

#+begin_src python :session
x = 2
x
#+end_src

#+RESULTS:
: 2

#+begin_src python :session
c = 0
for i in range(100000):
    c = c + i
c
#+end_src

#+RESULTS:
: 4999950000

#+begin_src python :session :results silent
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
matplotlib.use("Agg")
#+end_src

#+begin_src python :session :results output
X = np.random.normal(0, 1, 100) # localtio, scale, size
print(X)
#+end_src

#+RESULTS:
#+begin_example
[-0.15499918 -0.13274123 -1.02029678 -0.80169491  0.67538132  1.55367145
  0.49163082 -0.52709101 -0.84546881 -0.96587399 -0.13899605  0.79461426
  0.72056023  0.1253326  -0.28500212  0.05786446  0.17968108  0.45792829
  0.81095084 -0.10302278  0.21214727  0.77008816 -0.85436974  0.08661013
 -0.7061839   0.5824942   2.61347736 -1.35252921 -0.62543675 -0.71181511
 -1.3826333   0.54332016 -0.05263134 -1.61283438  0.85729668 -0.4293321
  1.9228509  -0.45193747 -0.38052108 -0.61368448 -0.59166471 -1.04843365
 -0.06996334  1.6569798   0.70670694 -1.0361955   1.48291496 -0.14419824
 -0.30398019 -0.45243789 -2.34818264 -1.39391377 -1.68712786 -1.7071706
  1.35141289 -1.45466054  0.38241086 -0.30542271 -0.07231988  0.13980549
 -1.40592014  0.11739573  0.58823557 -0.13394309  0.64086817 -0.75969421
 -0.57580026 -0.12892573  1.84330896 -1.03505217  0.2952197   0.01869907
 -0.70487947 -0.31231992 -1.10286492  0.25932281 -1.56863975  0.78212618
 -1.89049333  1.57527151 -1.16589455 -0.48786691 -0.48822611 -0.32764014
  1.34830349 -0.21659481  0.44327302  0.33353746  0.23963125  1.05660242
  1.02445672 -0.44237021  1.90261022 -0.14112004 -0.41795878  0.33151865
 -0.70877425  0.05402306 -0.3105704   0.52786524]
#+end_example

#+begin_src python :session :results file
# fig=plt.figure(figsize=(6, 4))
plt.plot(X)
# fig.tight_layout()
plt.savefig("img/norm-dist.png")
"img/norm-dist.png"
#+end_src
